tools/backOfficeProvisioning/templates/getServiceAvailabilityTemplate.xml

<soapenv:Envelope xmlns:pub="http://www.wildblue.viasat.com/XMLSchema/v2/webservice/PublicServiceAvailabilityWebService" xmlns:pws="http://www.wildblue.viasat.com/XMLSchema/PublicWebService/v1.0/PWSHeader" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
       <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">        
            <wsu:Timestamp wsu:Id="TS-AE8FE8760FD06C7BC9151735181136170">
                <wsu:Created>2018-01-30T22:36:51.361Z</wsu:Created>
                <wsu:Expires>2018-01-30T22:41:51.361Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-AE8FE8760FD06C7BC9151735181136169">
                <wsse:Username>QAADMIN</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">d3druBrekEa</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">ZZAxo548d8bfXp5ASI3BUQ==</wsse:Nonce>
                <wsu:Created>2018-01-30T22:36:51.361Z</wsu:Created>
            </wsse:UsernameToken>
       </wsse:Security>
      <pws:wildBlueHeader>
         <pws:invokedBy>
            <pws:username>2018-01-30:02:36:51</pws:username>
            <pws:application>1517351811340</pws:application>
         </pws:invokedBy>
      </pws:wildBlueHeader>
   </soapenv:Header>
   <soapenv:Body>
      <pub:getServiceAvailability>
         <pub:location>
             <!-- GeoPosition currently seems to not affect output, so commenting out -->
            <!--<GeoPosition>
               <latitude>1.051732E7</latitude>
               <longitude>-1.051732E7</longitude>
            </GeoPosition>-->
            <Address type="">
               <countryCode>?</countryCode>
               <postalCode>92009</postalCode>
               <municipality>Carlsbad</municipality>
               <region>CA</region>
               <addressLine>6155 El Camino Real</addressLine>
            </Address>
         </pub:location>
         <pub:salesChannel>FIELD_TRIAL</pub:salesChannel>
      </pub:getServiceAvailability>
   </soapenv:Body>
</soapenv:Envelope>
